########## ZIPファイル作成スクリプト                  ###########################
##########  新規作成:2022/8/19                 ###########################
##########  修正(ZIPファイルの名前を変更):2022/9/8  ############################
##########  作成者: T.HATTORI  ###########################################
#########################################################################

#$date = Get-Date -Format 'yyyyMMdd'
$gendir="c:\work2\自己紹介サイト_丸の内_服部隆央"
$target="c:\compress\自己紹介サイト_丸の内_服部隆央.zip"



echo "開始"

Compress-Archive $gendir -DestinationPath $target -Force
if($? -eq "True" ){
    echo "成功しました"
} else {
    echo "失敗しました"
}

echo "終了"